ririyeye/co_mcu/bsp/gd32e11/co_driver/uart/co_uart.cpp
// UART 驱动实现：
// 1. 维护 uart_handle（含发送/接收队列、互斥信号量）
// 2. 中断服务例程根据硬件事件推进当前会话并调度完成回调
// 3. 协程接口在 co_uart.hpp 中模板化（支持自定义 allocator）
extern "C" {
#include "gd32e11x_rcu.h"
}
#include "co_uart.hpp"
#include "semaphore.hpp"
#include "syswork.hpp"

using namespace co_wq;

// 内部结构定义（模板仅依赖前向声明与访问函数）

struct uart_handle : worknode {
    explicit uart_handle(const struct uart_hard_info* info, workqueue<cortex_lock>& wq)
        : wq_(wq), mInfo(info), sem(wq_, 1, 1)
    {
        INIT_LIST_HEAD(&list_work_tx);
        INIT_LIST_HEAD(&list_work_rx);
    }

    struct workqueue<cortex_lock>& wq_;

    uint32_t is_init : 1;

    int baud_rate = 115200; // 默认波特率

    const struct uart_hard_info* mInfo;

    list_head list_work_tx;
    list_head list_work_rx;

    Semaphore<cortex_lock> sem;
};

struct uart_hard_info {
    rcu_periph_enum rcu_uart;
    uint32_t        uart_periph;
    IRQn_Type       uart_irq_num;

    void (*uart_pin_cfg)(const struct uart_hard_info* pinfo);
};

static void uart0_pin_cfg(const struct uart_hard_info* pinfo)
{
    (void)pinfo;
    rcu_periph_clock_enable(RCU_GPIOA);

    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_9);
    gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10);
}

static void uart1_pin_cfg(const struct uart_hard_info* pinfo)
{
    (void)pinfo;
    rcu_periph_clock_enable(RCU_GPIOA);

    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);
    gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_3);
}

static const struct uart_hard_info hard_u0 = {
    .rcu_uart     = RCU_USART0,
    .uart_periph  = USART0,
    .uart_irq_num = USART0_IRQn,
    .uart_pin_cfg = uart0_pin_cfg,
};

static const struct uart_hard_info hard_u1 = {
    .rcu_uart     = RCU_USART1,
    .uart_periph  = USART1,
    .uart_irq_num = USART1_IRQn,
    .uart_pin_cfg = uart1_pin_cfg,
};

struct uart_handle uart_0(&hard_u0, get_sys_workqueue()); // UART0
struct uart_handle uart_1(&hard_u1, get_sys_workqueue()); // UART1

// 硬件底层初始化（时钟 / GPIO / USART 配置）
static void uart_hard_init(const struct uart_hard_info* phard, int baud_rate)
{
    nvic_irq_enable(phard->uart_irq_num, 0, 0);

    rcu_periph_clock_enable(phard->rcu_uart);
    /* USART configure */
    usart_deinit(phard->uart_periph);
    usart_baudrate_set(phard->uart_periph, baud_rate);
    usart_receive_config(phard->uart_periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(phard->uart_periph, USART_TRANSMIT_ENABLE);
    usart_enable(phard->uart_periph);

    if (phard->uart_pin_cfg) {
        phard->uart_pin_cfg(phard);
    }
}

// 若未初始化则进行一次底层硬件初始化
static struct uart_handle* _uart_ext_handle_require(struct uart_handle* puart)
{
    if (puart->is_init) {
        return puart;
    }

    puart->is_init = 1;

    // 防御性初始化（构造函数已做）
    if (list_empty(&puart->list_work_tx)) {
        INIT_LIST_HEAD(&puart->list_work_tx);
    }
    if (list_empty(&puart->list_work_rx)) {
        INIT_LIST_HEAD(&puart->list_work_rx);
    }

    uart_hard_init(puart->mInfo, puart->baud_rate);

    return puart;
}

// 通过编号获取句柄（目前仅支持 0）
struct uart_handle* uart_handle_get(int num)
{
    struct uart_handle* phandle = NULL;
    switch (num) {
    case 0:
        phandle = _uart_ext_handle_require(&uart_0);
        break;
    case 1:
        phandle = _uart_ext_handle_require(&uart_1);
        break;

    default:
        break;
    }

    return phandle;
}

// 返回互斥信号量（供 init 协程获取独占）
Semaphore<cortex_lock>& uart_handle_get(struct uart_handle* puart)
{
    return puart->sem;
}

// 停止接收（关闭相关中断与超时）
static void uart_stop_rx(const struct uart_hard_info* phard)
{
    usart_receiver_timeout_disable(phard->uart_periph);
    usart_interrupt_disable(phard->uart_periph, USART_INT_RBNE);
    usart_interrupt_disable(phard->uart_periph, USART_INT_RT);
    usart_flag_clear(phard->uart_periph, USART_FLAG_RT);
}

static void uart_setup_rx(struct uart_handle* phandle, struct uart_session* pnod);

// 一个接收会话完成：放入工作队列并尝试启动下一个
static int uart_rx_handle(struct uart_handle* phandle, struct uart_session* pnod)
{
    phandle->wq_.add_new_nolock(*pnod);

    if (!list_empty(&phandle->list_work_rx)) {

        worknode*     pbase = list_first_entry(&phandle->list_work_rx, worknode, ws_node);
        uart_session* pnxt  = static_cast<uart_session*>(pbase);

        uart_setup_rx(phandle, pnxt);
    }
    return 1;
}

// 核心中断处理：
// - 接收超时事件
// - 接收数据就绪
// - 发送缓冲空
// 返回触发完成回调的工作节点数量
static int _uart_irq_handle(struct uart_handle* phandle)
{
    int retcnt = 0;

    const struct uart_hard_info* phard = phandle->mInfo;
    // receive timeout
    if (RESET != usart_interrupt_flag_get(phard->uart_periph, USART_INT_FLAG_RT)) {
        uart_stop_rx(phard);
        if (list_empty(&phandle->list_work_rx)) {
            return retcnt;
        }
        worknode*     pbase = list_first_entry(&phandle->list_work_rx, worknode, ws_node);
        uart_session* pnod  = static_cast<uart_session*>(pbase);

        retcnt += uart_rx_handle(phandle, pnod);
    }

    /* receive data */
    if (RESET != usart_interrupt_flag_get(phard->uart_periph, USART_INT_FLAG_RBNE)) {
        if (list_empty(&phandle->list_work_rx)) {
            uart_stop_rx(phard);
            return retcnt;
        }

        worknode*     pbase = list_first_entry(&phandle->list_work_rx, worknode, ws_node);
        uart_session* pnod  = static_cast<uart_session*>(pbase);

        pnod->buff[pnod->cur_len++] = usart_data_receive(phard->uart_periph);

        if (pnod->cur_len >= pnod->len) {
            uart_stop_rx(phard);
            retcnt += uart_rx_handle(phandle, pnod);
        }
    }
    /* transmit data */
    if (RESET != usart_interrupt_flag_get(phard->uart_periph, USART_INT_FLAG_TBE)) {
        if (list_empty(&phandle->list_work_tx)) {
            usart_interrupt_disable(phard->uart_periph, USART_INT_TBE);
            return retcnt;
        }

        worknode*     pbase = list_first_entry(&phandle->list_work_tx, worknode, ws_node);
        uart_session* pnod  = static_cast<uart_session*>(pbase);
        usart_data_transmit(phard->uart_periph, pnod->buff[pnod->cur_len++]);
        if (pnod->cur_len >= pnod->len) {
            phandle->wq_.add_new_nolock(*pnod);
            retcnt++;
            if (list_empty(&phandle->list_work_tx)) {
                usart_interrupt_disable(phard->uart_periph, USART_INT_TBE);
            }
        }
    }

    return retcnt;
}

// 包装：加锁 + 触发工作队列
static void uart_irq_handle(struct uart_handle* phandle)
{
    uint32_t lk  = lock_acquire();
    int      evt = _uart_irq_handle(phandle);
    lock_release(lk);

    if (evt) {
        phandle->wq_.trig_once();
    }
}

extern "C" void USART0_IRQHandler(void)
{
    uart_irq_handle(&uart_0);
}

extern "C" void USART1_IRQHandler(void)
{
    uart_irq_handle(&uart_1);
}

// 启动发送：仅使能发送空中断即可触发循环
static void uart_setup_tx(struct uart_handle* phandle)
{
    usart_interrupt_enable(phandle->mInfo->uart_periph, USART_INT_TBE);
}

// 启动接收：根据会话配置可选开启超时
static void uart_setup_rx(struct uart_handle* phandle, struct uart_session* pnod)
{
    usart_interrupt_enable(phandle->mInfo->uart_periph, USART_INT_RBNE);

    if (pnod->flg.rx_timeout > 0) {
        usart_receiver_timeout_enable(phandle->mInfo->uart_periph);
        usart_receiver_timeout_threshold_config(phandle->mInfo->uart_periph, pnod->flg.rx_timeout);

        usart_interrupt_enable(phandle->mInfo->uart_periph, USART_INT_RT);
    }
}

// 挂接一个会话到发送或接收队列；若为空队列则立即启动硬件
static int _uart_ext_transfer_cb(struct uart_handle* handle, uart_session& psess)
{
    uint32_t tx_setup = 0;
    uint32_t rx_setup = 0;

    auto flg = psess.flg;

    // 第一个工作节点 使能 UART
    if (flg.tx_not_rx && list_empty(&handle->list_work_tx)) {
        tx_setup = 1;
    }

    if (!flg.tx_not_rx && list_empty(&handle->list_work_rx)) {
        rx_setup = 1;
    }

    if (flg.tx_not_rx) {
        list_add_tail(&psess.ws_node, &handle->list_work_tx);
    } else {
        list_add_tail(&psess.ws_node, &handle->list_work_rx);
    }

    if (tx_setup) {
        uart_setup_tx(handle);
    }

    if (rx_setup) {
        uart_setup_rx(handle, &psess);
    }

    return 0;
}

// 外部可调用（协程模板）：封装加锁
int uart_ext_transfer_cb(struct uart_handle* handle, uart_session& psess)
{
    uint32_t lk  = lock_acquire();
    int      ret = _uart_ext_transfer_cb(handle, psess);
    lock_release(lk);
    return ret;
}

// 访问工作队列（协程模板使用）
co_wq::workqueue<cortex_lock>& uart_handle_wq(struct uart_handle* handle)
{
    return handle->wq_;
}

int uart_handle_set_baudrate(struct uart_handle* handle, int baud)
{
    if (!handle) {
        return -1;
    }
    // 需持有外部互斥（由调用方保证）。这里只做最小复位配置以避免影响队列状态。
    handle->baud_rate = baud;
    usart_disable(handle->mInfo->uart_periph);
    usart_deinit(handle->mInfo->uart_periph);
    usart_baudrate_set(handle->mInfo->uart_periph, baud);
    usart_receive_config(handle->mInfo->uart_periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(handle->mInfo->uart_periph, USART_TRANSMIT_ENABLE);
    usart_enable(handle->mInfo->uart_periph);
    return 0;
}

// templated coroutine definitions moved to header

void UartManager::release()
{
    if (handle_) {
        ::uart_handle_get(handle_).release();
        handle_ = nullptr;
    }
}

UartManager::~UartManager()
{
    release();
}
